src/Catalogs/Scan_МестаХранения/Scan_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_МестаХранения</name>
  <comment>Места хранения (отгрузки, доставки)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Маршруты</name>
      <description>Маршруты</description>
    </items>
    <items>
      <name>МестаХраненияАдресаКлиентов</name>
      <description>Места хранения – адреса клиентов</description>
    </items>
    <items>
      <name>МестаХранения</name>
      <description>Места хранения (площадки)</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаФактический</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарубежныйКузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовНаПлощадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительный</name>
    <comment>Место хранения больше не используется в программе, но сведения о нем сохранены. Недействительные места хранения скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличиеВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияДилера</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.Scan_ТипыСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЧекЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользований</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапрещатьПеремещениеМестаХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СрокиДоставки</name>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_МатрицаСроковДоставкиИзделийАвтовозом/Scan_МатрицаСроковДоставкиИзделийАвтовозом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_МатрицаСроковДоставкиИзделийАвтовозом</name>
  <comment>Матрица сроков доставки продуктов  (scania)</comment>
  <resources>
    <name>СрокДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>АдресОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АдресДоставки</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ВзаимосвязьКонтактныхЛицИМестХранения/Scan_ВзаимосвязьКонтактныхЛицИМестХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВзаимосвязьКонтактныхЛицИМестХранения</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьВПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_МестаХранения/ManagerModule.bsl
//rarus tenkam 05.10.2016 mantis 7161 ++

// Функция записи параметров в регистр сведений
Функция ЗаписьЗначенияРСМатрицаСроковДоставкиИзделий(АдресОтгрузки, АдресДоставки, СпособДоставки, СрокДоставки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.АдресОтгрузки,
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.АдресДоставки,
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.СпособДоставки,
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.СрокДоставки
	               |ИЗ
	               |	РегистрСведений.Scan_МатрицаСроковДоставкиИзделийАвтовозом КАК Scan_МатрицаСроковДоставкиИзделийАвтовозом
	               |ГДЕ
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.СрокДоставки = &СрокДоставки
	               |	И Scan_МатрицаСроковДоставкиИзделийАвтовозом.АдресОтгрузки = &АдресОтгрузки
	               |	И Scan_МатрицаСроковДоставкиИзделийАвтовозом.АдресДоставки = &АдресДоставки
	               |	И Scan_МатрицаСроковДоставкиИзделийАвтовозом.СпособДоставки = &СпособДоставки";
	Запрос.УстановитьПараметр("СрокДоставки", СрокДоставки);
	Запрос.УстановитьПараметр("АдресОтгрузки", АдресОтгрузки);
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		//записи нет - добавим
		
		Если СрокДоставки = 0 Тогда
			
			//rarus tenkam 07.02.2017 TLMS 011 +++
			НаборЗаписей = РегистрыСведений.Scan_МатрицаСроковДоставкиИзделийАвтовозом.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.АдресОтгрузки.Установить(АдресОтгрузки);
			НаборЗаписей.Отбор.АдресДоставки.Установить(АдресДоставки);
			НаборЗаписей.Отбор.СпособДоставки.Установить(СпособДоставки);
			НаборЗаписей.Записать();
			
			НаборЗаписей = РегистрыСведений.Scan_МатрицаСроковДоставкиИзделийАвтовозом.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.АдресОтгрузки.Установить(АдресДоставки);
			НаборЗаписей.Отбор.АдресДоставки.Установить(АдресОтгрузки);
			НаборЗаписей.Отбор.СпособДоставки.Установить(СпособДоставки);
			НаборЗаписей.Записать();
			//rarus tenkam 07.02.2017 TLMS 011 ---
			Возврат Ложь;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.Scan_МатрицаСроковДоставкиИзделийАвтовозом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.АдресОтгрузки.Установить(АдресОтгрузки);
		НаборЗаписей.Отбор.АдресДоставки.Установить(АдресДоставки);
		НаборЗаписей.Отбор.СпособДоставки.Установить(СпособДоставки);
		
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.АдресОтгрузки = АдресОтгрузки;
		НоваяЗапись.АдресДоставки = АдресДоставки;
		НоваяЗапись.СпособДоставки = СпособДоставки;
		НоваяЗапись.СрокДоставки = СрокДоставки;
		НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.Scan_МатрицаСроковДоставкиИзделийАвтовозом.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.АдресОтгрузки.Установить(АдресДоставки);
		НаборЗаписей.Отбор.АдресДоставки.Установить(АдресОтгрузки);
		НаборЗаписей.Отбор.СпособДоставки.Установить(СпособДоставки);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.АдресОтгрузки = АдресДоставки;
		НоваяЗапись.АдресДоставки = АдресОтгрузки;
		НоваяЗапись.СпособДоставки = СпособДоставки;
		НоваяЗапись.СрокДоставки = СрокДоставки;
		НоваяЗапись.Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
		
		НаборЗаписей.Записать();
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// Функция возвращает срок доставки для указанных адресов в разрезе способа доставки
Функция ПолучитьСрокДоставки(АдресОтгрузки, АдресДоставки, СпособДоставки) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.СпособДоставки,
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.СрокДоставки
	               |ИЗ
	               |	РегистрСведений.Scan_МатрицаСроковДоставкиИзделийАвтовозом КАК Scan_МатрицаСроковДоставкиИзделийАвтовозом
	               |ГДЕ
	               |	Scan_МатрицаСроковДоставкиИзделийАвтовозом.АдресОтгрузки = &АдресОтгрузки
	               |	И Scan_МатрицаСроковДоставкиИзделийАвтовозом.АдресДоставки = &АдресДоставки
	               |	И Scan_МатрицаСроковДоставкиИзделийАвтовозом.СпособДоставки = &СпособДоставки";
				   
	Запрос.УстановитьПараметр("АдресОтгрузки", АдресОтгрузки);
	Запрос.УстановитьПараметр("АдресДоставки", АдресДоставки);
	Запрос.УстановитьПараметр("СпособДоставки", СпособДоставки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СрокДоставки;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции
//rarus tenkam 05.10.2016 mantis 7161 --

//rarus tenkam 05.10.2016 mantis 7183 ++

// Функция возвращает маршрут между двумя местами хранения либо пустую ссылку на справочник 
Функция ПолучитьМаршрут(МестоИсходное, МестоКонечное) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_МестаХранения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Scan_МестаХранения КАК Scan_МестаХранения
	               |ГДЕ
	               |	Scan_МестаХранения.ИсходныйПункт = &ИсходныйПункт
	               |	И Scan_МестаХранения.КонечныйПункт = &КонечныйПункт
	               |	И Scan_МестаХранения.Маршрут = ИСТИНА
				   //rarus bonmak 19.06.2020 15981
	               |	И НЕ Scan_МестаХранения.Недействительный";
	Запрос.УстановитьПараметр("ИсходныйПункт", МестоИсходное);
	Запрос.УстановитьПараметр("КонечныйПункт", МестоКонечное);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.Scan_МестаХранения.ПустаяСсылка();
	КонецЕсли;
КонецФункции
//rarus tenkam 05.10.2016 mantis 7183 --

// Функция записи параметров в регистр сведений
Функция ЗаписьЗначенияРегистраСведения(Знач МестоХранения, Знач КонтактныеЛица, НаДату = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	НаборЗаписей = РегистрыСведений.Scan_ВзаимосвязьКонтактныхЛицИМестХранения.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.МестоХранения.Установить(МестоХранения); 
	
	Для Каждого СтрокаМассива Из КонтактныеЛица Цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.МестоХранения = МестоХранения; 
		НоваяЗапись.КонтактноеЛицо = СтрокаМассива.КонтактноеЛицо;
		//rarus pechek 2.04.2020 15672 +++
		НоваяЗапись.ДоступностьВПФ = СтрокаМассива.ДоступностьВПФ;
		//rarus pechek 2.04.2020 15672 ---
	КонецЦикла; 
	Попытка
		НаборЗаписей.Записать(); 
	Исключение
		//rarus FominskiyAS 19.04.2019  mantis 14191 +++
		//Сообщить(НСтр("ru = 'Ошибка записи Контактного лица по месту хранения в регистр сведений'"));
		Сообщить(НСтр("ru = 'Ошибка записи Контактного лица по месту хранения в регистр сведений'; en = 'Contact person saving failed'"));
		//rarus FominskiyAS 19.04.2019  mantis 14191 ---  
		Отказ = Истина;	
	КонецПопытки;
	
	Возврат Отказ;
		
КонецФункции // ЗаписьЗначенияРегистраСведения()
